app/controllers/auth_controller.rb

      app_client = AppClient.new
      app_client.clinet_no = body["shop_id"]
      app_client.refresh_token = body["refresh_token"]
      app_client.save
---
INSERT INTO "app_clients" ("clinet_no", "refresh_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["clinet_no", "TEST_TAKAYAMA"], ["refresh_token", "5d40b22424eee9c48c95bb8c4c9e067da3"], ["created_at", "2016-05-01 13:24:09.617939"], ["updated_at", "2016-05-01 13:24:09.617939"]]